In [9]:
import numpy as np
import pandas as pd

In [10]:
# .apply() method

In [11]:
df = pd.read_csv('tips.csv')

In [12]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [13]:
df.info() # as we see, CC number is not a string (object).

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [14]:
str(1234567890)[-4:] # -4 den basla sona kadar git. int larda bu yapilmaz str olmasi lzm o y√ºzden str yazdik.

'7890'

In [15]:
def last_four(num):
    return str(num)[-4:]

In [16]:
last_four(123456789)

'6789'

In [17]:
df['CC Number'].apply(last_four) # komutu ile otomatik olarak hangi column icin hangi fonksiyonu calistirmak istedigimizi yazariz.

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [18]:
df['total_bill'].mean()

19.78594262295082

In [19]:
def yelp(price):
    if price < 10:
        return '$'
    elif price >=10 and price < 30:
        return '$$'
    else:
        return '$$$'

In [20]:
df['yelp'] = df['total_bill'].apply(yelp)  # bu sekilde yazildiginda yelp bir column olarak df ye eklenmis olur.

In [21]:
df['yelp']

0      $$
1      $$
2      $$
3      $$
4      $$
       ..
239    $$
240    $$
241    $$
242    $$
243    $$
Name: yelp, Length: 244, dtype: object

In [22]:
aa  = df['total_bill'].apply(yelp)

In [23]:
aa

0      $$
1      $$
2      $$
3      $$
4      $$
       ..
239    $$
240    $$
241    $$
242    $$
243    $$
Name: total_bill, Length: 244, dtype: object

In [24]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,yelp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

In [25]:
# Bu yukarida yazdigimiz .apply() fonksiyonu kullanimi sadece kullanacagimiz fonksiyon icerisinde bir deger var ise calisir.
# C√ºnk√º kullandigimiz columnklarin her birisinde de birer deger vardir. Her bir satir icin bir deger d√∂nd√ºrerek bu islemi devam ettiririz.

In [26]:
# -- 2. Ders :

In [27]:
def simple(num) :
    return num*2

In [28]:
simple(2)

4

In [31]:
#df['total_bill'].apply(simple)
df['total_bill'].apply(lambda bill: bill*2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [32]:
# There are too many methods to use .apply function. We can check them through (the link in using methods files).